# Pandas @Kaggle

### Let us employ our new found powers to a Kaggle Competition

## First setup check

In [2]:
import pandas as pd
print ('pandas: ',pd.__version__)

pandas:  0.18.1

## Read Test & Train for the Titanic Competition

In [3]:
import datetime
from pytz import timezone
print( "Last run @%s" % (datetime.datetime.now(timezone('US/Pacific'))))

Last run @2016-08-12 11:35:03.664129-07:00

In [4]:
df_train = pd.read_csv('data/titanic/train.csv')
df_test = pd.read_csv('data/titanic/test.csv')

In [5]:
df_train.count() # non-NA counts

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [6]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df_train.describe()

/Users/davidwilson/anaconda/lib/python3.5/site-packages/numpy/lib/function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,NaN,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,NaN,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,NaN,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
df_train.groupby(['Sex','Survived']).size() #count()#[['Survived','Sex']]

Sex     Survived
female  0            81
        1           233
male    0           468
        1           109
dtype: int64

In [9]:
by_gender = df_train.groupby(['Sex','Survived']).size().unstack()
#by_gender.columns[1] = "Dead"
by_gender

Survived    0    1
Sex
female     81  233
male      468  109

In [10]:
by_gender.columns[0]

0

In [11]:
by_gender.rename(index=str,columns={0:"Dead",1:"Live"})

Survived  Dead  Live
Sex
female      81   233
male       468   109

In [12]:
by_gender[0]

Sex
female     81
male      468
Name: 0, dtype: int64

In [13]:
by_gender['Total'] = by_gender[0] + by_gender[1]
by_gender

Survived    0    1  Total
Sex
female     81  233    314
male      468  109    577

In [14]:
by_gender['Percent'] = (by_gender[1] / by_gender['Total']) * 100
by_gender

Survived    0    1  Total    Percent
Sex
female     81  233    314  74.203822
male      468  109    577  18.890815

In [15]:
print( "F-Survived   = %2.2f %%" % ( (233.0/(81+233))*100 ))
print( "M-Survived   = %2.2f %%" % ( (109.0/(468+109))*100 ))
print( "All-Survived = %2.2f %%" % ( ((233.0+109)/(81+233+468+109))*100 ))
print( "All-Not Survived = %2.6f %%" % (100-(((233.0+109)/(81+233+468+109))*100)))

F-Survived   = 74.20 %
M-Survived   = 18.89 %
All-Survived = 38.38 %
All-Not Survived = 61.616162 %

In [16]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
pd.crosstab(df_train["Sex"],df_train["Survived"])

Survived    0    1
Sex
female     81  233
male      468  109

In [18]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [19]:
df_test.count()

PassengerId    418
Pclass         418
Name           418
Sex            418
Age            332
SibSp          418
Parch          418
Ticket         418
Fare           417
Cabin           91
Embarked       418
dtype: int64

## #1 : Simple Model (M=Survived)

In [20]:
gender_model = lambda row: [0,1] [row['Sex'] == 'male']
df_test['Survived'] = df_test.apply(gender_model,axis=1)
# This was an error. I thought I was doing F=Survived ! Anyway, I let it stand

In [21]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,1
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0

In [22]:
df_test[['PassengerId','Survived']].to_csv('data/titanic/sub-01.csv', index=False, float_format="%f")
# Submit and you will get 0.23445 & be rediculed forever ;o(

In [23]:
df_test.groupby(['Sex','Survived']).size().unstack()

Survived      0      1
Sex
female    152.0    NaN
male        NaN  266.0

## #2 : Simple Model (F=Survived)

In [22]:
gender_model = lambda row: [1,0] [row['Sex'] == 'male']
df_test['Survived'] = df_test.apply(gender_model,axis=1)
df_test.head() # Now I got it right !

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [25]:
df_test[['PassengerId','Survived']].to_csv('data/titanic/sub-02.csv', index=False, float_format="%f")
# Submit and you will get 0.76555

In [26]:
df_test.groupby(by=['Sex','Survived']).size().unstack()

Survived      0      1
Sex
female      NaN  152.0
male      266.0    NaN

##### Exercise #1: See if PClass, SibSp or Parch is a better indication and change survival accordingly

## Now clean the data for applying tree algorithms

In [54]:
df_train.drop(['Ticket','Cabin','Embarked','Age','Name'],inplace=True,axis=1)

In [55]:
df_train.head()

   PassengerId  Survived  Pclass     Sex  SibSp  Parch     Fare
0            1         0       3    male      1      0   7.2500
1            2         1       1  female      1      0  71.2833
2            3         1       3  female      0      0   7.9250
3            4         1       1  female      1      0  53.1000
4            5         0       3    male      0      0   8.0500

In [56]:
gender_code = lambda row: [1,0] [row['Sex'] == 'male']
df_train['Gender'] = df_train.apply(gender_code,axis=1)

In [57]:
df_train.head()

   PassengerId  Survived  Pclass     Sex  SibSp  Parch     Fare  Gender
0            1         0       3    male      1      0   7.2500       0
1            2         1       1  female      1      0  71.2833       1
2            3         1       3  female      0      0   7.9250       1
3            4         1       1  female      1      0  53.1000       1
4            5         0       3    male      0      0   8.0500       0

In [58]:
df_train.drop('Sex',inplace=True,axis=1)

In [59]:
df_train.head()

   PassengerId  Survived  Pclass  SibSp  Parch     Fare  Gender
0            1         0       3      1      0   7.2500       0
1            2         1       1      1      0  71.2833       1
2            3         1       3      0      0   7.9250       1
3            4         1       1      1      0  53.1000       1
4            5         0       3      0      0   8.0500       0

## #3 : Simple CART Model

In [60]:
from sklearn.tree import DecisionTreeClassifier
clf = DecisionTreeClassifier() #Default Values incl criterion='gini'; could be critirion='entropy'

In [61]:
clf_data = df_train[['Pclass','SibSp','Parch','Fare','Gender']].values
clf_target = df_train.Survived.values

In [62]:
clf = clf.fit(clf_data,clf_target)

#### Now, transform the test data

In [64]:
df_test.drop(['Ticket','Cabin','Embarked','Age','Name'],inplace=True,axis=1)
df_test.head(n=1)

   PassengerId  Pclass   Sex  SibSp  Parch    Fare  Survived
0          892       3  male      0      0  7.8292         1

In [65]:
gender_code = lambda row: [1,0] [row['Sex'] == 'male']
df_test['Gender'] = df_test.apply(gender_code,axis=1)

In [66]:
df_test.head(n=1)

   PassengerId  Pclass   Sex  SibSp  Parch    Fare  Survived  Gender
0          892       3  male      0      0  7.8292         1       0

In [67]:
df_test.drop('Sex',inplace=True,axis=1)
df_test.head(n=1)

   PassengerId  Pclass  SibSp  Parch    Fare  Survived  Gender
0          892       3      0      0  7.8292         1       0

In [68]:
clf_test_data = df_test[['Pclass','SibSp','Parch','Fare','Gender']].values
clf_test_predict = clf.predict(clf_test_data)

ValueError: Input contains NaN, infinity or a value too large for dtype('float32').

In [69]:
df_test.count()

PassengerId    418
Pclass         418
SibSp          418
Parch          418
Fare           417
Survived       418
Gender         418
dtype: int64

In [70]:
df_test.describe()

,PassengerId,Pclass,SibSp,Parch,Fare,Survived,Gender
count,418.000000,418.000000,418.000000,418.000000,417.000000,418.000000,418.000000
mean,1100.500000,2.265550,0.447368,0.392344,35.627188,0.636364,0.363636
std,120.810458,0.841838,0.896760,0.981429,55.907576,0.481622,0.481622
min,892.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,996.250000,1.000000,0.000000,0.000000,NaN,0.000000,0.000000
50%,1100.500000,3.000000,0.000000,0.000000,NaN,1.000000,0.000000
75%,1204.750000,3.000000,1.000000,0.000000,NaN,1.000000,1.000000
max,1309.000000,3.000000,8.000000,9.000000,512.329200,1.000000,1.000000

In [71]:
df_test_1 = df_test.fillna(35) # might be better to filin with average

In [72]:
clf_test_data = df_test_1[['Pclass','SibSp','Parch','Fare','Gender']].values
clf_test_predict = clf.predict(clf_test_data)

In [73]:
df_test_1.head()

   PassengerId  Pclass  SibSp  Parch     Fare  Survived  Gender
0          892       3      0      0   7.8292         1       0
1          893       3      1      0   7.0000         0       1
2          894       2      0      0   9.6875         1       0
3          895       3      0      0   8.6625         1       0
4          896       3      1      1  12.2875         0       1

In [74]:
change_predict = clf_test_predict != df_test_1['Survived']

In [75]:
change_predict.mean()

0.8564593301435407

In [76]:
df_test_1['Survived'] = clf_test_predict

In [78]:
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-03.csv', index=False, float_format="%f")
# Submit and you will get 0.75120/0.74163/..

## #4 : Random Forest Model

In [79]:
from sklearn.ensemble import RandomForestClassifier

In [80]:
clf = RandomForestClassifier(n_estimators=10)

In [81]:
clf = clf.fit(clf_data,clf_target)

In [82]:
clf_test_predict = clf.predict(clf_test_data)

In [83]:
df_test_1['Survived'] = clf_test_predict

In [84]:
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-04.csv', index=False, float_format="%f")
# Submit and you will get 0.75598/0.76077

In [86]:
clf = RandomForestClassifier(n_estimators=100)
clf = clf.fit(clf_data,clf_target)
clf_test_predict = clf.predict(clf_test_data)
df_test_1['Survived'] = clf_test_predict
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-05.csv', index=False, float_format="%f")
# Submit and you will still get 0.75598/0.76555-improved second try
# RF needs more features. We have only 5

## #5 : SVM

In [87]:
from sklearn.svm import SVC

In [88]:
clf = SVC() # kernel = 'rbf' Radial Basis Function
clf = clf.fit(clf_data,clf_target)
clf_test_predict = clf.predict(clf_test_data)
df_test_1['Survived'] = clf_test_predict
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-06.csv', index=False, float_format="%f")
# Submit and you will still get 0.74641

In [89]:
clf = SVC(kernel = "linear")
clf = clf.fit(clf_data,clf_target)
clf_test_predict = clf.predict(clf_test_data)
df_test_1['Survived'] = clf_test_predict
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-07.csv', index=False, float_format="%f")
# Submit and you will still get 0.76555

In [90]:
clf = SVC(kernel = "sigmoid")
clf = clf.fit(clf_data,clf_target)
clf_test_predict = clf.predict(clf_test_data)
df_test_1['Survived'] = clf_test_predict
df_test_1[['PassengerId','Survived']].to_csv('data/titanic/sub-08.csv', index=False, float_format="%f")
# Submit and you will still get 0.62679

## Homework

1. How many of each gender survived ? Answered
2. Did age make any difference ? 
    - Hint : Use cut to stratify
3. Did passengers travelling with spouses/siblings have a better chance of survival ?

### _That is ALL Folks !_